# encoding: utf-8
# language: ru

Функционал: Пересчет возраста в месяцы
	Как кадровик
	Хочу Получать возраст человека в месяцах
	Чтобы экономить на калькуляторе

Сценарий: Дата рождения человека 12.10.2000 сегодя 22.09.2016
	Допустим дата рождения человека равна 12.10.2000
	и сегодня равно 22.09.2016
	Тогда возраст в месяцах будет равен 191 

Сценарий: Дата рождения человека 12.09.2000 сегодя 22.09.2016
	Допустим дата рождения человека равна 12.10.2000
	и сегодня равно 22.10.2016
	Тогда возраст в месяцах будет равен 192 

	
Сценарий: Дата рождения человека 12.10.2000 сегодя 22.10.2016
	Допустим дата рождения человека равна 12.10.2000
	и сегодня равно 22.10.2016
	Тогда возраст в месяцах будет равен 192 
	

	
